robgee1964/STM32/USER/Invaders.c
/**
*  @file   Invaders.c
*  @author Rob Gee
*  @date   November 2017
*  @brief  Space invaders type game
*/

/***** Include files  *********************************************/
#include "stm32f10x.h"
#include <stdlib.h>
#include <string.h>
#include "bsp.h"
#include "Graphics.h"
#include "GraphText.h"
#include "Sprites.h"
#include "Invaders.h"

/***** Constants  *************************************************/
#define MAX_UINT16            0xffffU
#define MARGIN                40U
#define TOP_ROW_OFFSET        35U
#define HORIZ_SPACING         20U
#define VERT_SPACING          15U
#define LEFT_OFFSET           (MARGIN+20U)
#define INVADER_Y_OFST(row)   ((row)*VERT_SPACING)
#define SHELTER_MARGIN        (MARGIN+30U)
#define SHELTER_WIDTH         22U
#define NUM_SHELTERS          4U
#define SHELTER_SPACING       ((NUM_X_PIXELS - (2 * SHELTER_MARGIN) - SHELTER_WIDTH)/(NUM_SHELTERS-1))
#define SHELTER_Y             (NUM_Y_PIXELS-56U)
#define LASER_HEIGHT          8U
#define LASER_Y               (NUM_Y_PIXELS-28U)
#define LASER_MISSILE_REST_Y  (LASER_Y)
#define BOTTOM_ROW_Y          (NUM_Y_PIXELS-13U)
#define LASER_WIDTH           13U
#define LASER_STATUS_Y        BOTTOM_ROW_Y
#define LASER_GAP             7U
#define NUM_LASERS            3U
#define FONT_WIDTH            6U

#define MIN_GAME_Y            20U                              
#define MAX_GAME_X            (NUM_X_PIXELS-MARGIN)
#define MIN_GAME_X            (MARGIN)

#define ALIENS_PER_ROW        11U
#define NUM_ALIEN_ROWS        5U
#define MAX_ALIEN_ROW         (NUM_ALIEN_ROWS-1U)
#define MAX_ALIEN_COLUMN      (ALIENS_PER_ROW-1U)


#define LASER_ADD          1
#define LASER_REMOVE       0

#define INITIAL_LASERS     3

/* Animation paramters     */
#define LASER_SPEED           50U        /* 100 pixels per second */
#define MISSILE_SPEED_LASER   100U
#define MISSILE_SPEED_WIGGLE  100U
#define MISSILE_SPEED_CROSS   100U

#define ALIEN_ANIMATION_INTERVAL    240U
#define ALIEN_ANIMATION_INC         VIDEO_COUNTS(ALIEN_ANIMATION_INTERVAL)

#define LASER_INC             VIDEO_COUNTS(LASER_SPEED)
#define MISSILE_INC_LASER     VIDEO_COUNTS(MISSILE_SPEED_LASER)
#define MISSILE_INC_WIGGLE    VIDEO_COUNTS(MISSILE_SPEED_WIGGLE)
#define MISSILE_INC_CROSS     VIDEO_COUNTS(MISSILE_SPEED_CROSS)

#define ALIEN_DELAY_BASE      60U           /* Base delay between alien movements */
#define ALIEN_DELAY_INC       VIDEO_COUNTS(ALIEN_DELAY_BASE)

#define ALIEN_STEP            2              /* Use for left-right motion of aliens */

#define ALIEN_DESTROY_TIME    300
#define ALIEN_DESTROY_COUNTS  VIDEO_COUNTS(ALIEN_DESTROY_TIME)
#define SAUCER_DESTROY_TIME   500
#define SAUCER_DESTROY_COUNTS VIDEO_COUNTS(SAUCER_DESTROY_TIME)


/* Controls                 */
#define BTN_FIRE           GAME_BTN_1
#define BTN_LEFT           GAME_BTN_3
#define BTN_RIGHT          GAME_BTN_2

#define TIMING_TEST
#define KILL_ALIEN_COLUMNS


/***** Types      *************************************************/
typedef enum {SPRITE_PRESENT = 0, SPRITE_HIT = 1, ALIEN_DESTROYED=(SPRITE_HIT+ALIEN_DESTROY_COUNTS)} tSpriteState;
typedef enum {FALSE, TRUE} tBool;


typedef struct
{
   const tImage*  pSprite;
   uint16_t       x_ofst;
   uint16_t       y_ofst;
   uint16_t       x_interval;
   uint8_t        num_destroyed;   
   tSpriteState   sprite_state[ALIENS_PER_ROW];    
} tAlienRow;


/***** Storage    *************************************************/
static tAlienRow Aliens[NUM_ALIEN_ROWS] = {
      {&Invader30pt_1, 2, INVADER_Y_OFST(0), HORIZ_SPACING},
      {&Invader20pt_1, 0, INVADER_Y_OFST(1), HORIZ_SPACING},
      {&Invader20pt_1, 0, INVADER_Y_OFST(2), HORIZ_SPACING},
      {&Invader10pt_1, 0, INVADER_Y_OFST(3), HORIZ_SPACING},
      {&Invader10pt_1, 0, INVADER_Y_OFST(4), HORIZ_SPACING}
      };

static u8   *pBmpShelters;

static struct
{
   tImage   shelters[NUM_SHELTERS];
   uint16_t laser_x;
   int16_t  laser_inc;
   uint16_t  laser_missile_y;
   int16_t  alien_step; 
   uint16_t alien_x;
   uint16_t alien_new_x;
   uint16_t alien_y;
   uint16_t alien_new_y;
   uint8_t  num_living_aliens;
   uint8_t  i_alien_bmp;
   uint8_t  alien_step_timer;
   uint8_t  alien_step_interval;
   uint8_t  alien_anim_timer;
   uint8_t  num_lasers;
   uint8_t  level;
   uint8_t  left_alien_column;
   uint8_t  right_alien_column;
   uint8_t  top_alien_row;
   uint8_t  bottom_alien_row;
   uint8_t  destroyed_per_column[ALIENS_PER_ROW];
} gameCtx;

/* Sprite table for aliens animation  */
const tImage* pAlienSprites[][2] = {
      {&Invader30pt_1, &Invader30pt_2},
      {&Invader20pt_1, &Invader20pt_2},
      {&Invader20pt_2, &Invader20pt_1},
      {&Invader10pt_1, &Invader10pt_2},
      {&Invader10pt_2, &Invader10pt_1}};





/***** Local prototypes    ****************************************/
static void GameScreenInit(uint16_t level);
static void DrawLaserStatus(uint8_t action);
static void DrawLaser(uint16_t button_status);
static uint16_t FireLaser(uint16_t button_status);
static tBool CheckLaserHits(uint16_t laser_x);
static uint8_t DrawAliens(void);
static uint8_t AnimateAliens(void);
static uint8_t MoveAliens(void);
static void DrawShelter(uint8_t n);
static void KillAlien(uint16_t row, uint16_t column);
static void DrawDyingAliens(void);
static void InitialiseObjects(void);
static void TestKillAliens(uint16_t button_status);

/***** Exported functions  ****************************************/

/**
*  @fn         InvadersGame
*  @param[IN]  Button event
*  @brief      Space invaders type game
*/
void InvadersGame(t_ButtonEvent button_event)
{
   static uint8_t vBlankEvent = 0;
   static uint8_t alien_redraw = 0;
   static enum {GAME_INIT, GAME_PLAY, GAME_END} game_state = GAME_INIT;
   uint16_t btn_status;

   if (IsVblankActive() != 0)
   {
      if (vBlankEvent == 0)
      {
         /* vertical blanking active - do the screen writes */
         vBlankEvent = 1;   
         btn_status = ReadGameButtons();
         switch(game_state)
         {
            case GAME_INIT:
               InitialiseObjects();
               GameScreenInit(1);
               game_state = GAME_PLAY;
            break;
            
