robgee1964/STM32/USER/Invaders.c
            case GAME_PLAY:
               btn_status = ReadGameButtons();
               DrawLaser(btn_status);
               FireLaser(btn_status);
               if(1)
//               if(alien_redraw == 0)
               {
                  //TestKillAliens(ReadGameButtons());
                  DrawDyingAliens();
               }
               if(alien_redraw == 1)
//               else   /* if(alien_redraw == 1)  */
               {
                  while(DrawAliens() == 0);
                  //if(DrawAliens() == 1)
                  {
                     alien_redraw = 0;
                  }
               }
            break;
            
            case GAME_END:
            break;   
         }
      }
   }
   else
   {
      if(vBlankEvent == 1)
      {
         vBlankEvent = 0;     
         if(game_state == GAME_PLAY)
         {
            /* Screen being rendered - do non display related tasks such as hit detection */
            if((AnimateAliens() == 1) && (alien_redraw == 0))
            {
               alien_redraw = 1;
            }
            
//          if(alien_redraw == 0)
            if(1)
            {
//               if(AnimateAliens() == 1)
//                  alien_redraw = 1;
                  
               if(gameCtx.alien_step_timer >= gameCtx.alien_step_interval)
               {
                  gameCtx.alien_step_timer = 0;
                  if(MoveAliens() == 1)
                     game_state = GAME_END;
                  else
                     alien_redraw = 1;
               }
            }
            gameCtx.alien_step_timer++;
         }
      }
   }
}

/***** Local    functions  ****************************************/

/**
*  @fn         GameScreenInit
*  @param[IN]  level
*  @brief      Initialises game screen for current level
*/
static void GameScreenInit(uint16_t level)
{
   uint16_t row, count;
   uint16_t x, y;
   for (row = 0; row < NUM_ALIEN_ROWS; row++)
   {
      x = gameCtx.alien_x + Aliens[row].x_ofst;
      y = gameCtx.alien_y + Aliens[row].y_ofst;
      Aliens[row].num_destroyed = 0;
      for(count = 0; count < ALIENS_PER_ROW; count++)
      {
         Aliens[row].sprite_state[count] = SPRITE_PRESENT;
         GotoXY(x, y);
         PutBitmap((tImage*)Aliens[row].pSprite, GRAPH_SET);
         x += Aliens[row].x_interval;
       }
   }
   PutLine(MARGIN, BOTTOM_ROW_Y-2, NUM_X_PIXELS-MARGIN, BOTTOM_ROW_Y-2, GRAPH_SET);
   
   for(count = 0; count < NUM_SHELTERS; count++)
   {
      DrawShelter(count);
   }
   
   for(count = 0; count < NUM_LASERS; count++)
   {
      DrawLaserStatus(LASER_ADD);
   }

   GotoXY(gameCtx.laser_x, LASER_Y);
   PutBitmap((tImage*)&Laser, GRAPH_SET);

   SetFont(DEJAVUESANS6_10);
   GotoXY(MARGIN, 0);
   PutText("SCORE<1>", GRAPH_SET);
   GotoXY((NUM_X_PIXELS-(8*FONT_WIDTH))/2, 0);
   PutText("HI-SCORE", GRAPH_SET);
   GotoXY(NUM_X_PIXELS-MARGIN-(8*FONT_WIDTH), 0);
   PutText("SCORE<2>", GRAPH_SET);
   GotoXY(MARGIN+16, 10);
   PutText("0000", GRAPH_SET);
   GotoXY((NUM_X_PIXELS-(4*FONT_WIDTH))/2, 10);
   PutText("9990", GRAPH_SET);
   GotoXY(NUM_X_PIXELS-MARGIN-(9*FONT_WIDTH), BOTTOM_ROW_Y);
   PutText("CREDIT 03", GRAPH_SET);
}

/**
*  @fn         DrawLaserStatus
*  @param[IN]  action - add or remove
*  @brief      Draws number of lasers remaining
*/
static void DrawLaserStatus(uint8_t action)
{
   int16_t x;
   if (action == LASER_REMOVE)
   {
      gameCtx.num_lasers--;
      x = MARGIN + ((Laser.width + LASER_GAP)* gameCtx.num_lasers);
      FillRectangle(x, LASER_STATUS_Y, x + Laser.width -1, LASER_STATUS_Y + Laser.height -1, GRAPH_CLEAR);
   }
   else if(action == LASER_ADD)
   {
      x = MARGIN + ((Laser.width + LASER_GAP)* gameCtx.num_lasers);
      GotoXY(x, LASER_STATUS_Y);
      PutBitmap((tImage*)&Laser, GRAPH_SET);
      gameCtx.num_lasers++;
   }
}


/**
*  @fn         DrawLaser
*  @param[IN]  button status
*  @brief      Draws active laser on screen
*/
static void DrawLaser(uint16_t button_status)
{
   int16_t x_new;
   uint8_t redraw = 0;
   if(IS_GAME_BTN_PRESSED(button_status))
   {
      if(IS_PRESSED(button_status, BTN_LEFT))
      {
         if((x_new = gameCtx.laser_x - LASER_INC) >= MIN_GAME_X)
            redraw = 1;
      }
      else if(IS_PRESSED(button_status, BTN_RIGHT))
      {
         if((x_new = gameCtx.laser_x + LASER_INC) <= (MAX_GAME_X-Laser.width+1))
            redraw = 1;
      }
      if(redraw == 1)
      {
         FillRectangle(gameCtx.laser_x, LASER_Y, gameCtx.laser_x+Laser.width-1, LASER_Y+Laser.height-1, GRAPH_CLEAR);
         gameCtx.laser_x = (uint16_t)x_new;
         GotoXY(gameCtx.laser_x, LASER_Y);
         PutBitmap((tImage*)&Laser, GRAPH_SET);
      }
   }
}

/**
*  @fn         FireLaser
*  @param[IN]  button status
*  @return     laser x position or 0xffff if laser inactive
*  @brief      Starts laser missile on screen
*/
static uint16_t FireLaser(uint16_t button_status)
{
   static uint16_t button_status_prev = 0x07;
   static uint16_t missile_x;
   tBool hit;

   /* Animate missile  */
   if(gameCtx.laser_missile_y != LASER_MISSILE_REST_Y)
   {
      PutVline(missile_x, gameCtx.laser_missile_y, 3, GRAPH_CLEAR);
      
      if((hit = CheckLaserHits(missile_x)) == FALSE)
         gameCtx.laser_missile_y-=MISSILE_INC_LASER;

      if((gameCtx.laser_missile_y <= MIN_GAME_Y) || (hit == TRUE))
      {
         gameCtx.laser_missile_y = LASER_MISSILE_REST_Y;
      }
      else
         PutVline(missile_x, gameCtx.laser_missile_y, 3, GRAPH_SET);

   }

   if((IS_PRESSED(button_status, BTN_FIRE)) && (!IS_PRESSED(button_status_prev, BTN_FIRE)))
   {
      if(gameCtx.laser_missile_y == LASER_MISSILE_REST_Y)
      {
         missile_x = gameCtx.laser_x + (Laser.width>>1);
         gameCtx.laser_missile_y -= 3;
         PutVline(missile_x, gameCtx.laser_missile_y, 3, GRAPH_SET);
      }
   }
   button_status_prev = button_status;
   if(gameCtx.laser_missile_y != LASER_MISSILE_REST_Y)
      return missile_x;
   else
      return MAX_UINT16;
}

/**
*  @fn         CheckLaserHits
*  @param[IN]  laser missile x coordinate
*  @return     TRUE if laser missile hit alien
*  @brief      Checks if missile hit alien
*/
static tBool CheckLaserHits(uint16_t laser_x)
{
   uint16_t x_left, x_right;
   uint16_t y_alien;
   uint16_t column;
   static uint16_t row = MAX_ALIEN_ROW;
   tBool hit = FALSE;
   
   /* Work out lowest y coordinate of aliens array */
   y_alien = gameCtx.alien_y + Aliens[row].y_ofst + Aliens[row].pSprite->height-1;
   if(gameCtx.laser_missile_y <= y_alien)
   {
      x_left = gameCtx.alien_x + Aliens[row].x_ofst;
      for(column = gameCtx.left_alien_column; column <= gameCtx.right_alien_column; column++)
      {
         if(Aliens[row].sprite_state[column] == SPRITE_PRESENT)
         {
            x_right = x_left + Aliens[row].pSprite->width-1;
            if((laser_x >= x_left) && (laser_x <= x_right))
            {
               hit = TRUE;
               KillAlien(row, column);
               row = gameCtx.bottom_alien_row;
               break;
            }
         }
         x_left += HORIZ_SPACING;
      }
      if(hit == FALSE)
      {
         if(row > gameCtx.top_alien_row)
            row--;
         else
            row = gameCtx.bottom_alien_row;
      }
   }
   return hit;
}


/**
*  @fn         DrawAliens
*  @return     1 if complete, 0 otherwise
*  @brief      Renders aliens on screen
*              Designed to be called over more than one blanking interval
*/
static uint8_t DrawAliens(void)
{
   static int8_t row = MAX_ALIEN_ROW;
   uint8_t count;
   uint8_t complete = 0;
   uint16_t x;
   uint16_t y = gameCtx.alien_y + Aliens[row].y_ofst;
   uint16_t new_x, new_y;
   uint8_t w = Aliens[row].pSprite->width-1;
   uint8_t h = Aliens[row].pSprite->height-1;
   new_y = gameCtx.alien_new_y + Aliens[row].y_ofst;

