robgee1964/STM32/USER/Invaders.c
   #ifdef TIMING_TEST
   GPIO_ResetBits(DEBUG_PORT, DEBUG_PIN_1);
   #endif
   
   x = gameCtx.alien_x + Aliens[row].x_ofst;
   new_x = gameCtx.alien_new_x + Aliens[row].x_ofst;
   for(count = gameCtx.left_alien_column; count <= gameCtx.right_alien_column; count++)
   {
      if(Aliens[row].sprite_state[count] == SPRITE_PRESENT)
      {
         /* Erase bitmaps at old position */
         FillRectangle(x, y, x+w, y+h, GRAPH_CLEAR);
         /* draw new bit map */
         GotoXY(new_x, new_y);
         PutBitmap((tImage*)Aliens[row].pSprite, GRAPH_SET);
      }
      else if(Aliens[row].sprite_state[count] < ALIEN_DESTROYED)
      {
         /* Erase bitmaps at old position */
         FillRectangle(x-Aliens[row].x_ofst, y, 
                     x+InvaderExplode.width-Aliens[row].x_ofst-1, 
                       y+InvaderExplode.height-1, GRAPH_CLEAR);
         /* draw new bit map */
         GotoXY(new_x-Aliens[row].x_ofst, new_y);
         PutBitmap((tImage*)&InvaderExplode, GRAPH_SET);
      }
      new_x += Aliens[row].x_interval;
      x += Aliens[row].x_interval;
   }
   
   if(--row < gameCtx.top_alien_row)
   {
      complete = 1;
      row = gameCtx.bottom_alien_row;
      gameCtx.alien_x = gameCtx.alien_new_x;
      gameCtx.alien_y = gameCtx.alien_new_y;
   }
   #ifdef TIMING_TEST
   GPIO_SetBits(DEBUG_PORT, DEBUG_PIN_1);
   #endif
   
   return complete;
}


/**
*  @fn         AnimateAliens
*  @brief      Carried out bitmap swapping for alien animation
*/
static uint8_t AnimateAliens(void)
{
   uint8_t alien_redraw = 0;
   uint16_t count;
   
   if(++gameCtx.alien_anim_timer >= ALIEN_ANIMATION_INC)
   {
      gameCtx.alien_anim_timer = 0;
      if(gameCtx.i_alien_bmp == 0)
      {
         gameCtx.i_alien_bmp = 1;
         alien_redraw = 1;
      }
      else
      {
         gameCtx.i_alien_bmp = 0;
         alien_redraw = 1;
      }
      for(count = 0 ; count < NUM_ALIEN_ROWS; count++)
      {  
         Aliens[count].pSprite = pAlienSprites[count][gameCtx.i_alien_bmp];
      }
   }
   
   return alien_redraw;
}


/**
*  @fn         MoveAliens
*  @return     1 if game over
*  @brief      Calculates new position for aliens
*/
static uint8_t MoveAliens(void)
{
   uint16_t x, y;
   uint8_t game_over = 0;
   uint16_t w;
   uint16_t column, row, alien_col_left, alien_col_right;
   tBool finding_left = TRUE;
   tBool finding_bottom = TRUE;
   uint16_t bottom_alien_row = gameCtx.bottom_alien_row;
   uint16_t top_alien_row = gameCtx.top_alien_row;

   alien_col_left = gameCtx.left_alien_column;
   alien_col_right = gameCtx.right_alien_column;
  
   /* Check if left most or rightmost columns are empty */
   for(column = gameCtx.left_alien_column; column <= gameCtx.right_alien_column; column++)
   {
      if(finding_left == TRUE)
      {
         if(gameCtx.destroyed_per_column[column] < NUM_ALIEN_ROWS)
            finding_left = FALSE;
         else
         {
            alien_col_left++;
         }
      }
      if(finding_left == FALSE)
      {
         if(gameCtx.destroyed_per_column[alien_col_right] < NUM_ALIEN_ROWS)
         {
            gameCtx.right_alien_column = alien_col_right;
            break;
         }
         else
            alien_col_right--;
      }
   }
   gameCtx.alien_x += (HORIZ_SPACING*(alien_col_left - gameCtx.left_alien_column));
   gameCtx.left_alien_column = alien_col_left;

   
   /* See if lower rows have been emptied */
   row = NUM_ALIEN_ROWS-1;
   do
   {
      if(finding_bottom == TRUE)
      {
         if(Aliens[row].num_destroyed < ALIENS_PER_ROW)
            finding_bottom = FALSE;
         else
         {
            bottom_alien_row--;
         }
      }
      else if(finding_bottom == FALSE)
      {
         if(Aliens[top_alien_row].num_destroyed < ALIENS_PER_ROW)
         {
            gameCtx.top_alien_row = top_alien_row;
            break;
         }
         else
            top_alien_row++;
      }
   }
   while(row-- > gameCtx.top_alien_row);
   gameCtx.bottom_alien_row = bottom_alien_row;
   
   /* See if we are going to hit the screen edges */
   x = gameCtx.alien_x + gameCtx.alien_step;
   w = ((alien_col_right-alien_col_left) * (HORIZ_SPACING)) + 
                     Aliens[bottom_alien_row].pSprite->width-1;
   if((x >= MIN_GAME_X) && (x + w <= MAX_GAME_X))
   {
      gameCtx.alien_new_x = x;
      gameCtx.alien_new_y = gameCtx.alien_y;
   }
   else
   {
      y = gameCtx.alien_y + Aliens[bottom_alien_row].pSprite->height;
      gameCtx.alien_step = 0 - gameCtx.alien_step;
      x = gameCtx.alien_x + gameCtx.alien_step;
      gameCtx.alien_new_x = x;
      if((y+INVADER_Y_OFST(bottom_alien_row)) >= (LASER_Y-Aliens[bottom_alien_row].pSprite->height))
      {
         game_over = 1;
      }
      else
      {
         gameCtx.alien_new_y = y;
      }
   }
   
   return game_over;
}



/**
*  @fn         DrawLaser
*  @param[IN]  Shelter to draw/update
*  @brief      Draws active laser on screen
*/
static void DrawShelter(uint8_t n)
{
   uint16_t x = SHELTER_MARGIN + (n * SHELTER_SPACING);
   FillRectangle(x, SHELTER_Y, x+Shelter.width-1, SHELTER_Y+Shelter.height-1, GRAPH_CLEAR);
   GotoXY(x, SHELTER_Y);
   PutBitmap(&gameCtx.shelters[n], GRAPH_SET);
}

/**
*  @fn         DrawLaser
*  @param[IN]  row
*  @param[IN]  column
*  @brief      Draws active laser on screen
*/
static void KillAlien(uint16_t row, uint16_t column)
{
   if(Aliens[row].sprite_state[column] == SPRITE_PRESENT)
   {
      Aliens[row].sprite_state[column] = SPRITE_HIT;
   }
}


/**
*  @fn         DrawDyingAliens
*  @brief      Draws active laser on screen
*/
static void DrawDyingAliens(void)
{
   uint16_t x, y, row, column;
   
   y = gameCtx.alien_y + (gameCtx.top_alien_row * VERT_SPACING);
   for(row = gameCtx.top_alien_row; row <= gameCtx.bottom_alien_row; row++)
   {
      x = gameCtx.alien_x;
      for(column = gameCtx.left_alien_column; column <= gameCtx.right_alien_column; column++)
      {
         switch(Aliens[row].sprite_state[column])
         {
            case SPRITE_PRESENT:
            case ALIEN_DESTROYED:
            break;
            
            case SPRITE_HIT:
               /* draw exploding sprite */
               FillRectangle(x, y, x+InvaderExplode.width-1, y+InvaderExplode.height-1, GRAPH_CLEAR);
               GotoXY(x, y);
               PutBitmap((tImage*)&InvaderExplode, GRAPH_SET);
               Aliens[row].sprite_state[column]++;
            break;
            
            default:
               if(++Aliens[row].sprite_state[column] >= ALIEN_DESTROYED)
               {
                  FillRectangle(x, y, x+InvaderExplode.width-1, y+InvaderExplode.height-1, GRAPH_CLEAR);
                  gameCtx.destroyed_per_column[column]++;
                  Aliens[row].num_destroyed++;
                  gameCtx.num_living_aliens--;
                  gameCtx.alien_step_interval = (gameCtx.num_living_aliens/2) + ALIEN_DELAY_INC;
               }
            break;
         }
         x += HORIZ_SPACING;
      }
      y += VERT_SPACING;
   }
}


/**
*  @fn         InitialiseObjects
*  @brief      Initialises game variables
*/
static void InitialiseObjects(void)
{
   uint16_t n,i;
   
