robgee1964/STM32/USER/Invaders.c
/* Initialise game play variables */
   gameCtx.i_alien_bmp = 0;
   gameCtx.alien_anim_timer = 0;
   gameCtx.level = 0;
   gameCtx.laser_x = (NUM_X_PIXELS-LASER_WIDTH)/2U;
   gameCtx.laser_inc = (NUM_X_PIXELS-LASER_WIDTH)/2U;
   gameCtx.laser_missile_y = LASER_MISSILE_REST_Y;
   gameCtx.num_living_aliens = ALIENS_PER_ROW * NUM_ALIEN_ROWS;
   gameCtx.alien_step_timer = 0;
   gameCtx.alien_step_interval = (gameCtx.num_living_aliens/2) + ALIEN_DELAY_INC;
   gameCtx.alien_x = LEFT_OFFSET;
   gameCtx.alien_y = TOP_ROW_OFFSET;
   gameCtx.alien_new_x = LEFT_OFFSET;
   gameCtx.alien_new_y = TOP_ROW_OFFSET;
   gameCtx.alien_step = 0-ALIEN_STEP;
   gameCtx.top_alien_row = 0;
   gameCtx.bottom_alien_row = MAX_ALIEN_ROW;
   gameCtx.right_alien_column = MAX_ALIEN_COLUMN;
   gameCtx.left_alien_column = 0;
   
   for (i = 0; i < ALIENS_PER_ROW; i++) 
   {
      gameCtx.destroyed_per_column[i] = 0;
   }
   
/* Initialise shelter sprites in RAM */  
   n = ((Shelter.width+7)>>3) * (Shelter.height);
   pBmpShelters = malloc(n * NUM_SHELTERS);
 
   for (i = 0; i < NUM_SHELTERS; i++)
   {
      gameCtx.shelters[i].width = Shelter.width;
      gameCtx.shelters[i].height = Shelter.height;
      gameCtx.shelters[i].bitmap = pBmpShelters+(i * n);
      memcpy((void*)gameCtx.shelters[i].bitmap, (void*)Shelter.bitmap, n);
   }
   
}


/**
*  @fn         InitialiseObjects
*  @param[IN]  button_status
*  @brief      Initialises game variables
*/
static void TestKillAliens(uint16_t button_status)
{
   static uint16_t button_status_prev;
   static uint8_t kill_col = 0;
   uint16_t row;
   #ifdef KILL_RANDOM_ALIENS
   uint16_t alien_number, column;
   #elif defined KILL_ALIEN_COLUMNS
   static uint16_t kill_count = 0;
   #endif
   
   if(gameCtx.num_living_aliens > 0)
   {
      if((IS_PRESSED(button_status, BTN_FIRE)) && !(IS_PRESSED(button_status_prev, BTN_FIRE)))
      {
         #ifdef KILL_RANDOM_ALIENS
         while(1)
         {
            alien_number = rand() % (ALIENS_PER_ROW*NUM_ALIEN_ROWS);
            row = alien_number % NUM_ALIEN_ROWS;
            column = alien_number % ALIENS_PER_ROW;
            if(Aliens[row].sprite_state[column] == SPRITE_PRESENT)
            {
               KillAlien(row, column);
               break;
            }
         }
         #elif defined KILL_ALIEN_COLUMNS
         for(row = 0; row < NUM_ALIEN_ROWS; row++)
         {
            if(Aliens[row].sprite_state[kill_col] == SPRITE_PRESENT)
            {
               KillAlien(row, kill_col);
               if(++kill_count >= NUM_ALIEN_ROWS)
               {
                  kill_count = 0;
                  if(kill_col == gameCtx.left_alien_column)
                     kill_col = gameCtx.right_alien_column;
                  else
                     kill_col = gameCtx.left_alien_column;
               }
               break;
            }
         }
         #endif
      }
   }
   
   button_status_prev = button_status;
}
